[null,{"title":"Cyber Security & Advanced Technology | Attomus","href":"/","content":""},null,{"title":"About Us","href":"/about-us/","content":""},{"title":"Attomus Clients","href":"/about-us/attomus-clients","content":""},{"title":"A live malware infection - a real life study (Part 1)","tags":["cybersecurity","malware","security"],"href":"/blog/2019-a-live-malware-infection-a-real-life-study-part-1","content":" recently assisted a client that was aggressively hit with a phishing campaign. Following a couple of successful compromises they found themselves faced with an escalation with the malware attempting to impersonate staff, both emailing their customers and pivoting to attack the admin users in a secondary phishing attack. What made things a little more interesting than the usual [kiddy attack](https://en.wikipedia.org/wiki/Script_kiddie) was that the initial malware was not carrying a particularly nefarious payload, which meant that it escaped the usual malware detection that the client had deployed. The end result - the company was struggling to cope with identifying valid and invalid emails, both of which seemed to originate from internal staff. At the time they had two routes open to them - they either actioned everything that came in, both valid and nefarious, or they actioned nothing - but in both cases the end result would be a success for the attacker. ## How to identify the attack? The first step was to assess the capability of the attacker, and reverse engineer the initial malware to understand what it was attempting to do. This showed that it was calling back to a Command and Control server on a fixed IP address, hence the first objective: **block access to the C&C host**. This had two benefits, firstly it stopped the attack from escalating, but also by watching the logs we could see local machines attempting to reach the C&C host and therefore identify which machines had been compromised - it turns out not every member of staff is completely transparent when asked “Did you click on this link?”! A great start, we’ve now stopped things getting away from us. However we then had an additional complication - many staff had laptops and therefore they were able to reach the C&C host whilst out of the office and unprotected from the corporate firewall. Therefore **any machine that has left the protection of the corporate network is treated as hostile**. This meant that the corporate wifi needed to be disabled to avoid any machines connecting automatically, and every single machine that had left the site was quarantined from the corporate network until it was proven to be free of infection. ## Understand the infection method So now we’ve stopped the infection growing, and we’ve taken steps to avoid machines outside of our protection entering our network and reinfecting others. Next we needed to understand what the next phase of the infection would do, so we can protect ourselves accordingly. So we created a clean machine, running in isolation from the corporate network, with a monitoring device alongside it so that we could see any change to the machine, no matter how small and most importantly - we’re monitoring it independently of the Operating System so the malware shouldn’t be able to tell that it’s being watched unless it’s particularly sophisticated. > (This helps us see what’s happening, but we also need to see how the infection will run around the network. So we also created a honeypot, simulating the corporate network, but that’s outside the scope of this post - maybe we'll revisit in a new post soon.) Now we have the means to actively infect our machine, and watch the infection take place…and finally see what the attackers’ actual intent was. **So, now the fun part, let's move from being reactive to actively going on the hunt** Keeping an eye on our machine we connect it to the internet, running through a firewall that is set to monitor rather than restrict, and we now watch the infected machine connect out to the C&C machine. Throughout we capture the traffic off the network port using port mirroring, so the malware cannot detect it’s being monitored, which will allow us to examine and replay events at our leisure and if necessary provide a full analysis to a court of law. Once the malware connects to the C&C host, we watch the handshake as it identifies itself, before downloading the real malware to the host machine. This was effected by the malware triggering the request as a user driven event from the client machine, so a normal corporate firewall set to stop inbound events but permit users to get out without too many restrictions would have permitted the action through. Masquerading as a text file to circumvent primitive extension checks, the malware is now inside our host machine where it is renamed as an executable file and ostensibly executed by the user. We’re on…. > ….so that’s how an infection is seen, identified and stopped. Next in Part 2 we’ll explore how we find out what the malware itself was doing, and what we can do to protect ourselves against it."},{"title":"Insider Threats: A CISO Nightmare","tags":["security","insider-threat","CISO"],"href":"/blog/2019-insider-threats-a-ciso-nightmare","content":"# ** insider threats, your biggest assets become your biggest risks.** One of today’s most damaging security threat comes from trusted insiders. Insider threats can come from anyone in your organisation, from those with the highest access to your company data to those who you think have no access at all. Your insiders are both employees and third parties. The risk is at all levels. Its no wonder that 25% of all security incidents involve company insiders. ## Types of insider threats As the [CPNI](https://www.cpni.gov.uk/insider-threat) notes, an “insider” (also termed a cyber insider) “is someone who (knowingly or unknowingly) misuses legitimate access to commit a malicious act or damage their employer.” This means you can face unintentional or intentionally malicious acts from persons employed in or who has privileged access to your company. * **Unintentional insider harm** Unintentional harm stems from accidental data breaches. This could be through the carelessness or negligence of an employee or contractor. There is also the loss of employee credentials which can then be used for malicious intent. * **Intentional insider harm/Malicious threats** Intentional insider harm is where persons with trusted access in your company deliberately set out to cause the company harm. It can be to steal valuable company data or to insert malware or other viruses into your company network. Whichever area the threat comes from, there is the possibility of: * **Unauthorised access to confidential data** * **Unauthorised disclosure of confidential data** * **Fraudulent transactions** * **Systems or data sabotage** The threat is very real, and as a CISO, it makes your job of securing your company’s physical and digital assets that much more difficult. Too often, executives’ perception of the risks does not match the reality. And it’s therefore difficult to implement the solutions necessary to protect your company. ## The challenges for CISO With the complexity and varying individuals involved with insider threats, security professionals face a unique level of responsibility in securing company assets. The concern, therefore, surrounds how to detect insider threats, counter these activities, and respond to any ensuing cyber attacks as a result. ## Mitigating unintentional insider attacks Ensuring your employees and contractors understand the role they play in reducing unintended risks is important. It may be tempting to assume that all of your employees understand the risks they face daily, but it bodes well to remind them and inform those who didn’t. A marketing campaign targeted at raising awareness of various threats is often a good and simple solution to get your employees up to speed quickly. You can focus on areas such as: * identifying phishing attempts * how to avoid weak passwords * why they shouldn’t share passwords * the unintended accessibility of unlocked devices * the dangers of using unsecured Wi-Fi networks to do company business ## Planning for malicious insider attacks In addition to helping your team understand their potentially unintentional role in causing the company harm, you need to simultaneous focus on monitoring for deliberate insider threats. Every organisation should have internal controls to detect and prevent insider attacks. Areas of focus should include: * Data loss prevention * Data encryption * Identity and access management * Endpoint and mobile security * Cloud access security In addition to tools for control, there is also a need for tools to analyse these threats and attacks. Your insider threat program should also include: * Intrusion detection and prevention controls * Predictive analytics These are but just a few of the essential elements of a [comprehensive insider threat program](https://attomus.com/services/security/). As a CISO, you can’t afford to not have various levels of control and prevention strategies in place. ## Building out an insider threat program Insider threat is inevitable. Therefore, if you do not already have a formal program in place to mitigate insider risks, then there’s no time like the present to get started. You should focus on developing a program designed specifically to meet your firm’s uniqueness as a one-size fits all approach is not advisable. Let’s have a [quick chat](https://attomus.com/contact-us/) on how to build out your insider threat program with the right combination of deterrence, prevention, monitoring, detection, and post-breach forensics tools and skills."},{"title":"Managing Third-Party Risk - the Importance of Real-Time Intelligence ","tags":["ciso","security"],"href":"/blog/2019-managing-third-party-risk-the-importance-of-real-time-intelligence","content":" third-party risk is inevitable when you work with vendors, suppliers, contractors, and business partners. And the harrowing thing is that you have no control over their networks or security. On-off or snapshot assessments of third-party risks still leave your business vulnerable as neither your business nor the third-party’s operates in a static environment. As things change in real time, you need real-time intelligence to manage third-party risk in your firm. ## Why your security needs to focus on managing third-party risk Your organisation has to rely on third-party software, services, and/or contractors. That means your organisation faces digital risks from third-parties through the connections you make and the interactions you have. And a lot of online threat actors have started to focus on vulnerabilities in third-party access to gain entry to their target firms. That’s why, for example, [Transparency International UK](https://www.transparency.org.uk/publications/managing-third-party-risk-only-as-strong-as-your-weakest-link/) provides third-party anti-bribery guidelines to assist large, small, and medium enterprises to manage this threat. And there are many other ways that a third-party breach can impact your business. Like most businesses as they evolve, you’re probably also storing more data in a cloud-based setting. This is the trend across industries as more financial data, health records, and detailed consumer statistics are increasingly stored offsite. These developments allow businesses the flexibility to collect and analyse more data. However this comes at a price. And that price is the access that has to be given to your company’s partners, vendors, and other third-parties and the security threats this access poses. Once you’ve given external entities access to your network, or you’re connected to their network, the risk of breaches increases. As a result, their potential risks become yours as well. That means you’ll have to expend resources on managing risk exposure from direct and indirect threats. Threat intelligence, therefore, becomes one of the best ways to assess third-party risks and the potential impact on your business operations. Vulnerabilities and threats in an online space can rapidly change. So, having up-to-date information is essential to protect your systems and data. Point-in-time data can help but it doesn’t allow you to plan well or to take effective steps when a breach does happen that could potentially impact your business. Static assessments of a third-party’s risk provide you with a good baseline. Real-time monitoring allows you to track and measure risks as they change over time. As we’ve proven repeatedly in the businesses we’ve helped, real-time metrics facilitate real-time risk mitigation decisions. ## Getting real-time intelligence to manage your third-party risk Managing cyber risk requires the ability to measure risks and adjust to changes in the risk profile. This enables you and your security team to make decisions based on how to mitigate said risks. Managing these risks can only be accomplished with the support of threat intelligence delivered on a real-time basis. Getting real-time metrics is essential for an all-rounded and effective third-party risk management plan. When done arbitrarily, you’ll often have weak spots in your security. What you’ll need instead is a system that can filter the dark web for chatter on vulnerabilities directly and indirectly linked to you. You’ll want to know about breaches at your third parties and how they could impact your business. You’ll need data on software vulnerabilities and what kind of risks you and your partners could face as a result of these. Then you want a system that can filter all this noise to pinpoint what’s a real risk and start planning accordingly. Your company’s security is only as strong as your weakest link. If that weakest link is in a third-party asset then, it doesn’t matter how strong your overall security is, you need to strengthen that link. Third-party risk assessment allows you the flexibility to plug the gaps in your business and secure your company and customer data. To achieve this, it helps to work with a [cyber-security expert](https://attomus.com/) for effective real-time intelligence, analysis, and mitigation strategies. So, when your CISO comes to you with a request to include third-party risk assessment in your security budget, it’s not just about how to measure the ROI on your investment. It’s also about measuring the costs of not doing so to your business. If you’ve only done static risk assessment to date, you may want to take a step towards integrating real-time intelligence in your security risk assessment. [Attomus](https://attomus.com/services/security/) can help you start that process. And where you need a risk assessment system that offers ROI data to facilitate decision making, we’re the team to help you."},{"title":"The State of Cyber Crime in the UK","tags":["crime","cybersecurity"],"href":"/blog/2019-the-state-of-cyber-crime-in-the-uk","content":"-crime in the UK is on the rise. And the readiness of most firms to meet these challenges leave much to be desired for many local and regional businesses. In the UK alone, the Cabinet Office has estimated the cost of cyber-crimes on the economy at £27bn. At least an estimated £9.2bn of that is related to just the theft of IP from UK businesses. Companies bear the brunt of these financial losses. And unless our firms take firm security measures, we will continue to see a rise in breaches, hacks, espionage, and thefts from cyber-crime. # How ready are UK firms to combat cyber-crimes? According to Hiscox 2019 Cyber Readiness Report, only 10% of firms they surveyed achieved “expert” level status for cyber strategy and execution. This is an alarming statistic given that three in every five firms surveyed reported at least one attack in the year. That’s 61% of firms facing at least one cyber-attack. Given this statistic, it was also worrying to note that UK firms reported the lowest cybersecurity budget. With the low level of readiness of firms in the UK and across Europe, it’s important to understand what’s at stake with low-level cybersecurity. # Data is the big-ticket item Cyber espionage primarily goes after data. The personal information stolen is often much more lucrative than just stolen money as this type of data can be sold multiple times online. ## Number of cybercrimes do not equal the level of damage The impact of each case of cyber-crime offers a better assessment of the results of these actions. High-value targets are often the focus of well-executed cyber-attacks. And these large-scale attacks are much more profitable to the criminals than many small-scale attacks. # Attacks are more diverse Cyber attacks can be orchestrated using simple off-the-shelf tools bought online such as malware kits or coding. Or, you can be the target of an organised crime group who has chosen to dedicate its resources to infiltrating yours. So, you must be on the lookout for opportunistic threats, planned attacks, and even internal negligence that could open your business up to attacks. # The cost of doing nothing is high In addition to the financial losses that companies face from cyber-attacks, there are even more lasting impacts that will affect the bottom-line. These include: - Reputation Damage - Brand Damage - Damage to Consumer confidence # It’s time to take action As technology evolves at a rapid pace, cyber-crimes continue to grow in scale and complexity. Cyber-criminals are quickly identifying vulnerabilities in proprietary and third-party business tech and exploiting them. Like all businesses operating in the digital age, you are therefore at ever increasing risks of being a victim of a cybercrime. Simply installing cybersecurity software will not solve your business’s risks. The scale at which technology evolves requires that you are always on-top of your security game. The higher the value of the data you hold, the more effort and resources need to be allocated to its protection. Make sure to complete a thorough cyber risk assessment and use that to inform your company security plans. Then you can make an informed and improved investment in your cyber security and your company’s overall health. If you’d like to discuss how to run a cyber risk assessment aimed at reducing the economic impact of cyber-crimes, then give us a call at +44 20 3026 6250. Or you can send us a message at support@attomus.com."},{"title":"Linking Bitbucket Server to Netlify","tags":["atlassian"],"href":"/blog/2020-linking-bitbucket-server-to-netlify","content":" of the challenges facing companies using [Atlassian](https://atlassian.com) products behind the firewall is how to configure them to get the same functionality offered by their Cloud brethren. At Attomus we love [Netlify](https://netlify.com) but setting it up to auto-trigger builds from private repositories on [Bitbucket Server](https://www.atlassian.com/software/bitbucket) running behind a proxy and firewall - is not as simple as one would hope! Having gone through the process ourselves, we thought it could be valuable for others to put together a quick step by step guide; in our example we've got an NginX server acting as a proxy facing the internet, with bitbucket running on a private server, and we want to both trigger builds automatically when we commit an update to the repository, and to ensure Netlify has visibility of the code in order to actually build our site. *The same logic can be used for any scenario where we have a third party application that we want to integrate from the outside, Netlify is just an example.* We're going to run through the following steps: * Ensure Bitbucket can accept inbound SSH connections * Configure NginX to route outside SSH connections through to our Bitbucket server * Use the Netlify CLI to manually create our site and get the keys needed to link BitBucket to Netlify * Update BitBucket to set the keys needed to gain access to our repository, and the webhook to trigger the build * Test ## Open up Bitbucket for SSH connections So the first thing we need to ensure is that we have set up Bitbucket to accept SSH connections for pushing code and accessing our repositories. Usually (because it makes the config much easier!) we find that clients running behind a proxy like Apache or NginX only permit access via http, but Netlify requires SSH access so we're going to have to open things up a little. Let's pop into our Bitbucket installation through the web front end, and go into Server Settings. Scroll down to SSH access and ensure we have ticked 'SSH enabled', 'SSH access keys enabled' and then the details needed for your own installation. Note that the 'SSH port' is the port that Bitbucket is listening on your local bitbucket server, and the 'SSH Base URL' is the proxied URL which is the one that NginX is going to be listening on from outside your firewall. So in our example, we are facing the internet via our proxy as `repo.MYSITE.com` but our internal IP address is `10.1.2.3`. ![Enabling SSH keys](/blog-media/bitbucket-enabling-ssh-access.png \"Enabling SSH keys\") Let's quickly check that bitbucket is listening by using the following command ```bash netstat -tulpn | grep bitbucket ``` and then we can set our proxy up to match. *One thing to be aware of is that if you are using Bitbucket inside your firewall as well as from the outside, you'll need to ensure the /etc/hosts file on the Bitbucket server maps the external URL to your local IP address - e.g.* ```bash 127.0.0.1 localhost 127.0.0.1 repo.MYSITE.com ``` ## Set up NginX to proxy external SSH So now we know that Bitbucket is listening for SSH which means those inside our firewall can access fine, but we need to ensure those outside (including Netlify) can get through to our repository, but without exposing our Bitbucket server directly to the internet. To achieve this, we have to firstly ensure that NginX can handle streams (ssh is effectively just a TCP data stream) and not just its normal http traffic, and then set up the proxy to forward SSH traffic from the internet to our NginX server to correctly talk to our Bitbucket server. First of all, we need to make sure our installation of NginX can support streams. On a Debian machine, this means we need to install NginX-extras ```bash sudo apt-get install nginx-extras ``` Then we need to update nginx.conf to include our config file, similar to how we probably already have with our website traffic in a server block under `/etc/nginx/sites-enabled/`. ```bash # put this at the bottom of your nginx.conf file # Pick up SSH proxies stream { # Reverse proxy config files include /etc/nginx/streams-enabled/*; } ``` Create the directory `/etc/nginx/streams-enabled/` and create a config file for your site `repo.MYSITE.com` ```bash upstream bitbucket-ssh { server 10.1.2.3:7999; # Bitbucket internal IP } server { listen 22222; # proxied listener proxy_pass bitbucket-ssh; } ``` Once that's saved we can quickly check that our config is correct using `nginx -T` where we should see that our new config file has been picked up. If so, we can restart with `service nginx restart` to pick up the new config, and double check it with ```bash netstat -tulpn | grep 22222 ``` To finish up the NginX config, we can check our config is working correctly by connecting from outside our firewall with our usual access details: ```bash ssh username@repo.MYSITE.com -p 22222 ``` ## Configure Netlify & Bitbucket to talk to each other Next we need to create our Netlify site and get the public keys that will be used to authenticate with our Bitbucket server. At the time of writing, Netlify only allows us to connect to Bitbucket Cloud, Github and GitLab, so we're going to have to use the CLI to link our private repository. First we're going to have to install the cli tool and then link to our site : ```bash npm install netlify-cli -g netlify sites:create --manual --with-ci ``` The `--manual` means that we're going to be wanting the keys to link Netlify and Bitbucket together, and `--with-ci` will give us the webhook so we can trigger the build automatically when code is pushed to our repository. The CLI tool will prompt for a site name (you'll need to talk to Netlify support if you're wanting to link to an existing Netlify site, it's not possible at the moment from the command line), followed by the SSH remote URL - you can find this by going to your repository in Butbucket, clicking on Clone, then selecting the SSH option to find out the path. It will be something like ```bash ssh://git@repo.MYSITE.com:22222/myproject/mycode.git ``` and you'll then be given a public key that you'll have to cut and paste into the Bitbucket repository settings under access keys: Once this is keyed you can continue with the CLI tool, setting your build settings (which you can change later in the GUI) until you get provided with a webhook that needs to be cut and pasted into `Repository / Settings / Webhooks`. ## Test That's it, we should be up and running now. We've already checked that we have NginX proxying ok, so as soon as we completed our CLI tool Netlify would have connected in and, hopefully, built our site. If you navigate to Netlify and check you should find your site already built (or at least, attempted - check the build logs!). The final thing to check is the webhook is working, so push a small change to your repository and make sure that Netlify fires off a new build. That's it, you're done!"},{"title":"The Impact of Corona Virus on Cyber Security","tags":["cybersecurity","covid19","featured"],"href":"/blog/2020-the-impact-of-corona-virus-on-cyber-security","content":" COVID-19 (Coronavirus) pandemic is spreading globally at an alarming rate, and along with disruption in global health, it is also causing damages to social, economic and political systems all over the world. Nearly the entire world workforce is now working remotely from homes, causing them to heavily rely on digital tools and remote means of communication. This has allowed cyber criminals to capitalize the situation and actively exploit the COVID-19 crisis. According to the [Global Cyber Security Market Analysis](https://www.researchandmarkets.com/reports/5021764/global-cyber-security-market-analysis?utm_source=dynamic&utm_medium=GNOM&utm_code=b4lhdg&utm_campaign=1387344+-+Economic+Impact+of+COVID-19+on+Global+Cyber+Security+Market&utm_exec=cari18gnomd) report released in April 2020, the global cyber security market is forecasted to grow at a very slow average rate of 6.2% per annum up to the year 2023 – as a consequence of economic downfall due to the 2020 coronavirus pandemic. In a broad perspective, coronavirus crisis has already resulted in a massive overload on internet traffic. This is evident from the increased workload on technical support teams, weaker online security controls, workplaces with lesser secure devices and more exposure to risk. People are using online channels as a default medium for shopping as well as basic means of communication. Consequently, hackers are now more tempted to insert malicious code and generate more vulnerabilities with high-risk threats. ## The Risk Factors Let us consider some major changes resulting from the coronavirus crisis under this scenario. Firstly, with COVID-19, organisations are now more dependent on outsourced tools to keep running their business operations and to ensure their survival. This is highly likely to result in sensitive data being exposed, thus increasing the potential for supply chain attacks. Furthermore, since most online operations that have end-customers are using web-based services, and with most of these end users being unwary of risks, there are clearly more opportunities for cyber criminals. This explains why online businesses are now more exposed to cyber threats and that the trend will keep growing during the coronavirus crisis. Another trend on the rise is increased phishing attempts emphasizing on false information of COVID-19. Such attempts take advantage of a panicked masses using social engineering methods, and eventually may lead online users or an organization to take wrong decisions – all to the disadvantage of their cyber security. ## Threats to Look Out For The National Cyber Security Center (NCSC) has removed approximately 2000 corona-related online scams in March 2020 which included 471 online shops selling fake coronavirus relief items, 832 advance-fee fraudulent websites promising a reward in return for registration payments and another 555 malware sites intended to harm their visitors. Malicious websites have been set up in times of coronavirus with their domains registered with names including the word ‘corona’ or ‘coronavirus’. Spam emails are being made to grab a user’s attention by offering high-demand COVID-19 products such as masks, sanitizers and vitamins. If not this, then they intend to create panic and build a discourse of trust by presenting conspiracies about the pandemic. Moreover, phishing emails are supposedly being received from organisations like World Health Organisation where the scammers carefully craft emails appearing to be coming from these organisations and asking users to open phishing links or malicious attachments. In some instances, there has also been an increase in fake HR office emails where you are requested to participate in a fake coronavirus survey by impersonating as your IT or HR department and trying to steal username and password of users. In other instances, charities have also been contacted by fraudsters that claim to be from a legal organization and proposing to provide information of elderly or poor people at risk and in need of charity support. They are then asked to click on a fraudulent link to get their information which leads them to a fake website or are requested to pay money for the virus victims. Similarly, the move towards online medium and the same need as before for receiving instant response even in this crisis era means that client-side frameworks and third-party applications have to be involved directly on the websites. They are expected to launch effective marketing campaigns with efficient services and improved technical functionality.In the midst of this crisis, third-party code is being attacked by malicious campaigns and it is only a matter of time that the next breach takes place. In the wake of this crisis, for online businesses, some factors to be considered are attacks carried through third-party vendors, website attacks and those on storage hosting providers. In few cases, the hackers may compromise a software update eventually impacting your website visitors. In many other direct cases, they exploit third party vendors which can directly access your website code. Once inside they abuse the code and steal your data maliciously. ## Managing the Threat Landscape For remote workforce, organisations can take some important step to ensure security as employees work from home. They need to ensure that the remote access systems have been [configured securely](http://www.cardzgroup.com/ContactSmartCard.html) and are fully patched. Moreover, they should also have the capability to endure DDoS attacks and move their users towards approved and better solutions. Ecommerce websites also need to adopt online security best practices and propagatesafe buyingto their customers to ensure long term customer satisfaction. ## Final Thoughts… The coronavirus pandemic outbreak has resulted in an increase in the likelihood and impact of cyber fraud as organisations face massive financial and operational challenges. The nature of threats is also changing as cyber criminals exploit uncertainty, fear and panic arising out of the COVID-19 crisis. >_David Smith is a cryptographer with 12 years of experience in both the public and private sectors. He is currently working on his second startup (currently in stealth mode) that will track and interpret the use of contactless payments in the Greater China region. His expertise includes system design and implementation with contact and contactless smart cards, smart card personalization, mobile payments, and general knowledge and experience with APAC market trends and consumer preferences._"},{"title":"Using Organisational Culture to Improve Cyber Security","tags":["cybersecurity","culture","CISO","featured"],"href":"/blog/2020-using-organisational-culture-to-improve-cyber-security","content":" consistently recommend that you build a resilient business where cyber-security a priority. But what does organisational culture have to do with improving cyber-security? As most managers and CISOs know, one of the least static areas of business is cyber security. **That’s because more than half of the fraud in the UK is conducted online**. Therefore, in light of mounting attacks, it’s important to increase awareness at the company level. Plus, to ensure your cybersecurity policies are effective, you must get buy-in and action from all levels of staff. When you do, you can use organisational culture to improve cyber security. ## The State of Cyber Crime Heading Into 2020 The [National Audit Office](https://www.nao.org.uk/wp-content/uploads/2019/03/Progress-of-the-2016-2021-National-Cyber-Security-Programme.pdf) has confirmed what we already know – that the UK has a high level of exposure to and potential impact from cyber-attacks. This stems from the UK’s role in international organisations, such as NATO, and the openness of our digital economy. Because we have “one of the world’s most open and most digital economies” we are “vulnerable to attack from hostile counties, criminal gangs and individuals.” (House of Commons Report: “[Cyber Security In the UK 2017-19](https://publications.parliament.uk/pa/cm201719/cmselect/cmpubacc/1745/1745.pdf)’”) Operating in the current cyber threat landscape is difficult. The risks are multifaceted. It finds organisations navigating an increasingly complex cyber threat environment. As the [EESC’s Cybersecurity Study](https://www.thehaguesecuritydelta.com/media/com_hsd/report/191/document/qe-01-18-515-en-n.pdf) outlines, these risks affect: * Business continuity * Intellectual property * Personal integrity * Professional integrity So, you must consider all these areas and more when building your cybersecurity plan. ## Cybersecurity culture in the workplace Cybersecurity is everybody’s business because everyone loses out when a company is affected by a cyberattack. We care about the role of employees because careless and unaware employees are too often contributors to the success of cyber threats. You can start the cybersecurity process by creating the policies and frameworks just like the government agencies we work with. They are developing national frameworks for a policy and legal foundation for a resilient cyber-ecosystem. You should do the same on a micro-level in your company. However, unless you have the active involvement of staff, your efforts may not offer the ROI on your security investment that you expect. So, you want a system where cybersecurity practices are integrated *seamlessly* into everyday jobs. It is a delicate balance to improving security and getting company buy-in without alienating employees in the process. Too often, the approach taken to implement security changes neglects employee involvement, by failing to acknowledge the importance of staff in the implementation and ongoing execution. There are best practices that organisations can and should adopt. But it also means tailoring your security protocols to your unique business needs. **In a resilient business culture, information security is seen as everybody’s business.** In this environment, the culture you foster minimises insider threats. It also encourages employees to identify threats and actively respond to vulnerabilities. Crucially it starts with executives supporting the initiatives of their CSOs and CISOs. It’s about institutionalising security training programmes, which helps to develop better cybersecurity habits in employees and staff. ## Using Organisational Culture to Improve Cyber Security To be blunt, an organisation’s cybersecurity culture determines how secure the company or agency is. When cybersecurity is a part of your company’s culture, it will increase the level of integration in your employees’ activities at work and elsewhere. So, it’s time to build a more-agile-than-ever IT organisation. Improving employee practices starts with the [cybersecurity professional at your disposal](https://attomus.com/), and the security culture at your workplace. Let’s build long-term strategies that evolve and respond to changing threats. Today."},{"title":"Welcome","tags":[],"href":"/blog/welcome","content":"'s strange to be writing a blog; as a Security focused company so much of what we do is highly confidential that one gets accustomed to not talking about what we do. _Those that work with us, know what we do. Those that don't, don't need to._ But now we're developing some products, products for the commercial market. It's an exciting time for us, opening up to a new market and bringing our somewhat unique view of the world to bear. How well it will work we don't know, but whatever the end result will be it will certainly differ from what we envisage now. We're continuing with our core business, that doesn't change, we're good at it and have a number of unique skills and tools. But now we have something we can talk about too. So welcome to our new blog. We'll be discussing useful tips from across our portfolio - be it useful guides for unusual use cases with the Atlassian product set, exploring new technologies in DevOps and looking at the evolving world of Cyber Security. Where this will take us who knows, but we're starting!"},{"title":"Contact Us","href":"/contact-us/","content":""},{"title":"Contact Us","href":"/curiouslee/","content":""},{"title":"Privacy","href":"/privacy/","content":"# POLICY Attomus takes privacy very seriously. We will not sell, lease or exchange your personal data to, or otherwise share your personal data with, third parties in ways other than described in this Policy. ## What is this Privacy Policy for? This privacy policy covers the website https://attomus.com and Attomus's Products Semafore and CuriousLee. The policy sets out the different areas where user privacy is concerned and outlines the obligations & requirements of the users, the website, the applications and their owners. Furthermore, it includes the manner that these assets process, store and protect user data and information. ## The Website This website https://attomus.com and its owners Attomus Limited take a proactive approach to user privacy and ensuring the necessary steps are taken to protect the privacy of its users throughout their visiting experience. This website complies with UK & EU user privacy laws. ## The Applications The applications Semafore and CuriousLee take a proactive approach to user privacy and ensuring the necessary steps are taken to protect the privacy of users. The applications Semafore and CuriousLee comply with UK & EU privacy laws. ## Contact & Communication Users contacting this website and/or its owners do so at their own discretion and provide any such personal details requested at their own risk. Your personal information is kept private and stored securely until such time a it is no longer required or has no use, as detailed in the Data Protection Act 1998. Every effort has been made to ensure a safe and secure form to permit the submission process but we advise users emailing the website owners or using the website contact form that they do so at their own risk. This website, applications and their owners may use any information submitted to provide uses with further information about the products / services the company offers or to assist in answering any questions or queries users may submit. This includes using user information to subscribe users to the email newsletter Attomus operates but only when this was made clear to the user and their express permission was granted when submitting any form, or whereby a customer has previously purchased from or enquired about purchasing a product or service from Attomus Limited. This is by no means an entire list of user rights in regard to receiving email marketing material. User details are not passed on to any third parties. ## Aggregated Data Attomus Limited may also use your personal information to generate Aggregated Data for internal use and for sharing with others on a selective basis. “Aggregated Data” means records which have been stripped of information potentially identifying customers, landing pages or end-users, and which have been manipulated or combined to provide generalised, anonymous information. Your identity and personal information will be kept anonymous in Aggregated Data. ## External Links Although this website only looks to provide quality, safe and relevant external links, users are advised to adopt a policy of caution before clicking any external web links mentioned throughout this website. (External links are clickable text / banner / image links to other websites). The owners of this website cannot guarantee or verify the contents of any externally linked website despite our best efforts. Users should therefore note that they click on external links at their own risk and this website and its owners cannot be held liable for any damages or implications caused by visiting any external links mentioned. Attomus cannot be held responsible for any external links provided to users by other users of the applications Semafore and CuriousLee; Attomus does not have the ability to see, test or validate these links or indeed any data passed between users including but not limited to images, url links, text and documents. ## Social Media Platforms Communication, engagement and actions taken through external social media platforms that this website and its owners participate on are subject to the terms and conditions as well as the privacy policies held with each social media platform respectively. Users are advised to use social media platforms wisely and communicate / engage upon them with due care and caution in regard to their own privacy and personal details. This website and its owners will never ask for personal or sensitive information through social media platforms and encourage users wishing to discuss sensitive details to contact them through primary communication channels such as telephone or email. This website uses social sharing buttons which help share web content directly from web pages to the social media platform in question. Users are advised before using such social sharing buttons that they do so at their own discretion and note that the social media platform may track and save your request to share a web page respectively through your social media platform account. ## Shortened Links in Social Media This website and its owners through their social media platform accounts may share web links to relevant web pages. By default some social media platforms shorten lengthy urls and this website uses shortened links prefixed http://att.ms. Users are advised to take caution and use good judgement before clicking any shortened urls published on social media platforms by this website and its owners. Despite the best efforts to ensure only genuine urls are published many social media platforms are prone to spam and hacking and therefore this website and its owners cannot be held liable for any damages or implications caused by visiting any shortened links. ## Cookies and Log Files We use cookies and log files to track user information. Cookies are small amounts of data that are transferred to your web browser by a web server and are stored on your computer’s hard drive. We use cookies to track which page variant a visitor has seen, to track if a visitor has clicked on a page variant, to monitor traffic patterns and to gauge popularity of service options. We will use this information to deliver relevant content and services to you. This also allows us to make sure that visitors see the website they expect to see if they return to the same web URL and it allows us to tell you how many people click on your website. ## Contact Us If you have any questions or suggestions regarding our Privacy Policy, please use the [Contact Us](/contact-us) page."},{"title":"CuriousLee","href":"/products/","content":""},{"title":"curiouslee","href":"/products/curiouslee.html","content":" title CuriousLee type curiouslee "},{"title":"semafore","href":"/products/semafore.html","content":" title Semafore type semafore "},{"title":"Semafore","href":"/semafore/","content":""},{"title":"Services","href":"/services/","content":""},{"title":"Atlassian Partner","href":"/services/atlassian-partner","content":" Partner Attomus is proud to be a Solution Partner of Atlassian, providing premium support across the entire Atlassian portfolio of products including Jira, Confluence and Bitbucket, including fully managed hosting for clients wanting behind the firewall ownership and control without the personnel overhead. For secure government clients, Attomus provides NATO and HMG security-cleared consultants with our experience of working in high-security environments combined with deep Atlassian product knowledge in a unique offering, including operating the Atlassian stack in air-gapped environments. JIRA Core Manage any business project including marketing campaigns, HR onboarding, approvals and legal document reviews. JIRA Software Plan, track, and release world-class software with the #1 software development tool used by agile teams. JIRA Service Desk Give your customers an easy way to ask for help and your agents a fast way to resolve incidents. Confluence Confluence is a team collaboration software. Written in Java and mainly used in corporate environments, it is developed and marketed by Atlassian. Bitbucket Bitbucket is a web-based hosting service for projects that use either the Mercurial (since launch) or Git (since October 2011) revision control systems. {{}} Name * &nbsp; Company Title * Job Title Email * Telephone * County/Region * Country * Primary Business * Government Energy Manufacturing Software Development Financial Services Retail Consulting Services Other Please select at least one option. Approximate number of users * Goal/Objective * Security Performance Reducing Complexity Reliability Technical Support Admin/Operational Responsiveness Interest * Dev Ops Technical Support/Operations Support Implementation Life-Cycle Consulting/Strategy Other Licenses Non-Technical Support Migration Performance Tuning Please select at least one option. Proud To Be An Atlassian Solution Partner Whether you need products or services, our experts can help. By completing this form, you'll be connected to a dedicated sales consultant to customize a solution to meet your needs. Contact Now "},{"title":"Delivery","href":"/services/delivery","content":" Delivery Programme Management Improve organisational performance with quality programme management that solves digital problems. We manage and deliver complex digital systems through our in-house team of experts. Nothing is subcontracted as we take ownership of each project. That is why we are the programme recovery team business leaders call to resolve technology issues following other unsatisfactory work. P3O® Development (Portfolio, Programme and Project Office) Develop tailored P3O models for organisations to optimise the delivery of successful business outcomes. We create the governance framework and systems to leverage the benefits of P3O for an effective Portfolio, Programme and Project Office to manage and deliver multiple products and strategic results. The systems facilitate strategic monitoring of budgetary requirements and investments, risks analysis, and quality assurance. CxO Mentoring Proactive and confidential support and guidance for “C” suite executives. We offer confidential advice and technical support for innovative and strategic growth opportunities and business management. ATTOMUS challenges and inspires leaders and helps them stay accountable with personal, skills, and strategic management. We help C-level executives who are newly appointed, promoted, or for succession planning learn to stay focused to maximise the value of their enterprises. Cyber Forensics ATTOMUS builds cyber resilience to withstand and respond to complex and rapidly evolving cyber threats. If you experience a cyber breach, our experts trace the physical and digital evidence using traditional and electronic investigative techniques. We decipher who did it, when, and how. We collect and preserve the data to facilitate prosecution and future prevention. s"},{"title":"Investigations","href":"/services/investigations","content":" ATTOMUS delivers discreet and secure surveillance and private investigation services. We help government agencies, medical, insurance and legal firms that need to obtain judicial quality surveillance data, even in difficult to reach jurisdictions. We assist in insurance loss prevention, fraud, and civil litigation cases. Our investigators are highly trained observers who capture vital evidence using the latest technology. Acquisition Due Diligence Gain competitive advantage with quality risk management through comprehensive due diligence services. We provide information to guide the mergers and acquisition process for strategic decision making at all levels of the investment process. Our investigative services assess the potential joint venture/company’s operations, accounting processes, cyber risks, executive team, and management. We determine any unreported risks that could negatively impact a successful acquisition.Our acquisition due diligence team conducts in-depth research: for initial reviews to determine if you should enter negotiations to identify risks and opportunities of markets and clients for mergers or acquisitions to build profiles of opponents for hostile take-overs. Cyber Forensics ATTOMUS builds cyber resilience to withstand and respond to complex and rapidly evolving cyber threats. If you experience a cyber breach, our experts trace the physical and digital evidence using traditional and electronic investigative techniques. We decipher who did it, when, and how. We collect and preserve the data to facilitate prosecution and future prevention. "},{"title":"Security","href":"/services/security","content":" Forensics ATTOMUS builds cyber resilience to withstand and respond to complex and rapidly evolving cyber threats. If you experience a cyber breach, our experts trace the physical and digital evidence using traditional and electronic investigative techniques. We decipher who did it, when, and how. We collect and preserve the data to facilitate prosecution and future prevention. Physical protection Our physical protection services offer support from office to field. We protect buildings from physical threats, unauthorised access/egress with confidential data, defend against corporate espionage and protect personnel and assets. Our physical protection extends to field operations with high-threat environments to prevent car bombings and other adverse security hazards in transit. We protect individuals and families at home, work or during travel. We also offer training for hostage scenarios and how to handle high-stress situations Close Protection ATTOMUS has had the distinct privilege of providing specialist close protection services for executives, celebrities, and national leaders across the world. Our close personal protection services are effective and discreet. Our teams are extensively trained and have law enforcement and military experience. We offer executive close protection for persons working in challenging environments or who are at risk due to status or geographical location. Our experienced teams provide primary protection and support that prevent and handle emergencies locally and overseas. Each assignment starts with a thorough risk assessment. And we deploy the necessary security measures before and during protective services. Asset protection High-value targets and assets are at their most vulnerable during transit. Our asset protection service uses predictive modelling and data-centric security to discreetly secure and transport high-value assets or high priority items across the world. Our skilled protection teams will legally and safely transfer key individuals, medical data, currency, gold, and respond to emergencies if necessary. We also move items that you do not want to be viewed prior to unveiling such as exhibition pieces. "},{"title":"Technology","href":"/services/technology","content":" development and support Application Build Web Applications A creative combination of industry-leading web application skills, strategic intuitive designs, and responsive project management. We develop innovative business-driven user-focused web applications to drive results. Our process leads to smooth implementation and clearly defined performance metrics. We have successfully completed projects in a variety of industries such as security, healthcare, and the public sector. Enterprise Applications Proprietary enterprise applications built with security at the forefront. And tailored to specific company requirements or market niches. We have a specialised IT team of security experts, analysts, and developers to build custom enterprise applications for vertical markets. From HR systems to defence applications, we enjoy developing and deploying challenging enterprise projects. Host Secure, reliable and fast managed web hosting for public and private sector entities. As a company that values security at all levels, our hosting services are built on a platform of cyber security and vigilance to protect our client’s information and reliability for maximum uptime. Server management by ATTOMUS leaves our clients with more time to dedicate to their core activities. Cyber Forensics ATTOMUS builds cyber resilience to withstand and respond to complex and rapidly evolving cyber threats. If you experience a cyber breach, our experts trace the physical and digital evidence using traditional and electronic investigative techniques. We decipher who did it, when, and how. We collect and preserve the data to facilitate prosecution and future prevention. Atlassian Partner Attomus is proud to be a Solution Partner of Atlassian, providing premium support across the entire Atlassian portfolio of products including Jira, Confluence and Bitbucket, including fully managed hosting for clients wanting behind the firewall ownership and control without the personnel overhead. For secure government clients, Attomus provides NATO and HMG security-cleared consultants with our experience of working in high-security environments combined with deep Atlassian product knowledge in a unique offering, including operating the Atlassian stack in air-gapped environments. CIO Services Experienced, competent board directors to facilitate short-term or long-term strategic change. Technology is the new competitive advantage and we offer CIO Advisory Services that bridge the gap between business and technical worlds with good governance. Our CIOs facilitate the business transformation process at the board level for companies and organisations in both the public and private sectors. "},null]